# #ДЗ 

# strings

# 1)написати прогу яка вибирає зі введеної строки цифри і виводить їх через кому,
# наприклад:
# st = 'as 23 fdfdg544' введена строка
# 2,3,5,4,4        #вивело в консолі.
# #################################################################################

# print('Enter a string:  ')
# string = input()

# print(','.join([x for x in string if x.isdigit()]))

# 2)написати прогу яка вибирає зі введеної строки числа і виводить їх 
# так як вони написані
# наприклад:
#   st = 'as 23 fdfdg544 34' #введена строка
#   23, 544, 34              #вивело в консолі
# #################################################################################

# print('Enter a string:  ')
# string = input()

# print(', '.join(''.join([x if x.isdigit() else ' ' for x in string]).split()))


# list comprehension

# 1)є строка:
# greeting = 'Hello, world'
# записати кожний символ як окремий елемент списку і зробити його заглавним:
# ['H', 'E', 'L', 'L', 'O', ',', ' ', 'W', 'O', 'R', 'L', 'D']

# string = 'Hello, world'
# print([s for s in string.upper()])

# 2) з диапозону від 0-50 записати тільки не парні числа при цьому піднести їх до квадрату
# приклад:
# [0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, ...]

#print([i**2 for i in range(50) if i%2 != 0])

# function
# - створити функцію яка виводить ліст

# def show_list(l):
#     for i in l:
#         print(i)

# - створити функцію яка приймає три числа та виводить та повертає найбільше.

# def print_max(x, y, z):
#     max_num = max(x, y, z)
#     print(max_num)
#     return max_num

# - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше

# def print_max_ret_min(*args):
#     print(max(args))
#     return min(args)

# print(print_max_ret_min(1, 2, 56, 78, 123, -5))

# - створити функцію яка повертає найбільше число з ліста

# def get_max(l):
#     return max(l)

# - створити функцію яка повертає найменьше число з ліста

# def get_max(l):
#     return min(l)

# - створити функцію яка приймає ліст чисел та складає значення елементів ліста та повертає його.

# def add_list(l):
#    return sum(l)

# - створити функцію яка приймає ліст чисел та повертає середнє арифметичне його значень.

# def avg_list(l):
#     return sum(l) / len(l)


# ################################################################################################
# 1)Дан list:
#   list = [22, 3,5,2,8,2,-23, 8,23,5]
#   - знайти мін число
#   - видалити усі дублікати
#   - замінити кожне 4-те значення на 'X'

# custom_list = [22, 3,5,2,8,2,-23, 8,23,5]

# print(min(custom_list))
# custom_list = list(set(custom_list))
# print(custom_list)

# for (i, x) in enumerate(custom_list):
#     if i%4 == 0:
#         custom_list[i] = 'X'

# print(custom_list)
# 2) вивести на екран пустий квадрат з "*" сторона якого вказана як агрумент функції

# def draw_squere(a):
#     for i in range(a):
#         if i == 0 or i == a-1:
#             print('*' * a)
#         else:
#             print('*' + (' '*(a-2)) + '*')

# draw_squere(5)
# 3) вывести табличку множення за допомогою цикла while

# n = 1

# while n <= 10:
#     m = 1
#     while m <= 10:
#         print(f'{n} * {m} = {n*m}')
#         m+=1
#     print('****************************************************************')
#     n+=1


size = 10
i = 1

while i <= size:
    j = 1
    while j <= size:
        print(f'{i*j:4}', end=' ')
        j += 1
    i+=1
    print()


# 4) переробити це завдання під меню